# pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
df1=pd.DataFrame([[1,2,3,4],[5,6,7,8],[3,46,752,45],[23,56,37,86],[36,86,55,12]])

In [5]:
df1

    0   1    2   3
0   1   2    3   4
1   5   6    7   8
2   3  46  752  45
3  23  56   37  86
4  36  86   55  12

In [6]:
df1.head(3)

   0   1    2   3
0  1   2    3   4
1  5   6    7   8
2  3  46  752  45

In [7]:
df1.tail(3)

    0   1    2   3
2   3  46  752  45
3  23  56   37  86
4  36  86   55  12

## More on pandas and its dataframe

In [8]:
df1

    0   1    2   3
0   1   2    3   4
1   5   6    7   8
2   3  46  752  45
3  23  56   37  86
4  36  86   55  12

In [9]:
df1.shape

(5, 4)

In [15]:
df1.iloc[2:5,1:4]

    1    2   3
2  46  752  45
3  56   37  86
4  86   55  12